// Q. Vue CLIでアプリの雛形を生成する利点は何か？
// A. ネイティブES2015コードを簡単にブラウザに送ることができるようになる

// Q. ホーム画面がデータプロパティ「title」を表示できていない。なぜか？
// A. SFCの場合、データプロパティは新しいオブジェクトを返す関数が必要である。
//   W. データストアにtitleが定義されていないからではない。

// Q. 「Counter」コンポーネントがホーム画面に表示されない。なぜか？
// A. コンポーネントが登録(register)されていない。

// Q. ユーザーが "/login" ルートにアクセスした時、空白のページが表示された。なぜか？
// A. router.js で "/login" のルートオブジェクトが設定されていない。
//   W. App.vueに<router-view>要素がないためにルートを正しく表示できないのではない。

// Q. ライフサイクルフックの中で、APIからデータを取得するasyncメソッドを発火させるのに最もふさわしいものはどれか？
// A. beforeMount
//   D. 外部APIからのデータ取得を行う場合は、ユーザーの待ち時間を最小にするため、できるだけ所要時間を長く見込んでおきたい。
//      他の選択肢、mouted, beforeDestroy, destroyedはコンポーネントが表示された後で発生するライフサイクルであり、ユーザーの所要時間を増加させることになる。

// Q. URLにハッシュシンボル#が含まれている。普通のURLのように表示させるには何が必要か？
// A. Vue Routerの設定でHTML5 History Modeを有効にする。

// Q. ユーザーネームに応じたURLが表示される筈だが、正しく表示されていない。なぜか？
// A. Dynamic route matchingが有効化されていない。
//   D. Dynamic route matchingはRouter内で定義されたパターンを使用してルートを定義するものであり、Router内では:コロンで示し、URLでは"/user/evan", "user/evan/post/123"のようになる。

// Q. ユーザーがaboutリンクをクリックした時、ページ全体がリフレッシュされてしまった。これを避けるため、どんなRouter要素を使えばよいか？
// A. <router-link>
//   D. Vue Routerの<router-link>はユーザーナビゲーションを有効にし、ページ全体が再読み込みされるのを避けるといった利点がある。
//   W. <router-view>はコンポーネントの表示域を定義するためのものである。ビューをネストする際に重要となる。